node {
  name: "hed_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "is_training"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.333333343267
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.333333343267
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/max"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/mul"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/conv2d/Conv2D"
  op: "Conv2D"
  input: "hed_input"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/switch_t"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/switch_f"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Const"
  op: "Const"
  input: "^hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Const_1"
  op: "Const"
  input: "^hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch:1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch_1:1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch_2:1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Const"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/Conv2D"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_2"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_3"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/conv2d/Conv2D"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge"
  op: "Merge"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge_1"
  op: "Merge"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1:1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge_2"
  op: "Merge"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm_1:2"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/switch_t"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/switch_f"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Const"
  op: "Const"
  input: "^hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00999999977648
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Const_1"
  op: "Const"
  input: "^hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Merge"
  op: "Merge"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Const_1"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/Sub"
  op: "Sub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/Mul"
  op: "Mul"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/Sub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg"
  op: "AssignSub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/Sub"
  op: "Sub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/read"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/Mul"
  op: "Mul"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/Sub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1"
  op: "AssignSub"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/AssignMovingAvg_1/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_0/conv2d/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_0/conv2d/Relu"
  op: "Relu"
  input: "hed/mobilenet_v2/block0_0/conv2d/batch_normalization/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\006\000\000\000"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.27216553688
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.27216553688
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/max"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/mul"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/conv2d/Conv2D"
  op: "Conv2D"
  input: "hed/mobilenet_v2/block0_0/conv2d/Relu"
  input: "hed/mobilenet_v2/block0_1/conv2d/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 6
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 6
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 6
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros"
  op: "Fill"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros/shape_as_tensor"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 6
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Assign"
  op: "Assign"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean/read"
  op: "Identity"
  input: "hed/mobilenet_v2/block0_1/conv2d/batch_normalization/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
